import React, { useEffect } from "react";
import { useLocation } from "react-router-dom";

import "./policy.css";
import "../assets/variables.css";

const Policy = () => {
  const location = useLocation();

  useEffect(() => {
    if (location.hash) {
      const el = document.getElementById(location.hash.substring(1));
      if (el) {
        el.scrollIntoView({ behavior: "smooth" });
      }
    }
  }, [location]);

  return (
    <>
      <div className="policy-container">
        <h1 id="privacy-policy">Політика конфіденційності</h1>
        <p>Останнє оновлення: 15 травня 2025 року</p>
        <p>
          Ця Політика конфіденційності описує наші політики та процедури щодо
          збору, використання та розкриття Вашої інформації під час використання
          Вами Сервісу, а також інформує Вас про Ваші права на конфіденційність
          і те, як закон захищає Вас.
        </p>
        <p>
          Ми використовуємо Ваші персональні дані для надання та покращення
          Сервісу. Використовуючи Сервіс, Ви погоджуєтесь на збір та
          використання інформації відповідно до цієї Політики конфіденційності.
        </p>
        <h2>Тлумачення та визначення</h2> <h3>Тлумачення</h3>
        <p>
          Слова, з яких починається велика літера, мають значення, визначені в
          умовах, викладених нижче. Наступні визначення мають однакове значення
          незалежно від того, вжиті вони в однині чи множині.
        </p>
        <h3>Визначення</h3> <p>Для цілей цієї Політики конфіденційності:</p>
        <ul>
          <li>
            <p>
              <strong>Обліковий запис</strong> означає унікальний обліковий
              запис, створений для Вас для доступу до нашого Сервісу або його
              частин.
            </p>
          </li>
          <li>
            <p>
              <strong>Афілійована особа</strong> означає організацію, яка
              контролює, контролюється або перебуває під спільним контролем з
              однією зі сторін, де "контроль" означає володіння 50% або більше
              акцій, часток або інших цінних паперів, які дають право голосу при
              виборах директорів або іншого керівного органу.
            </p>
          </li>
          <li>
            <p>
              <strong>Компанія</strong> (згадується як "Компанія", "Ми", "Нас"
              або "Наш") означає FitMe.
            </p>
          </li>
          <li>
            <p>
              <strong>Файли cookie</strong> — це невеликі файли, які
              розміщуються на Вашому комп’ютері, мобільному пристрої або іншому
              пристрої вебсайтом, що містять інформацію про Вашу історію
              переглядів цього сайту та мають багато інших призначень.
            </p>
          </li>
          <li>
            <p>
              <strong>Країна</strong> означає: Україна
            </p>
          </li>
          <li>
            <p>
              <strong>Пристрій</strong> означає будь-який пристрій, який має
              доступ до Сервісу, наприклад комп’ютер, мобільний телефон або
              планшет.
            </p>
          </li>
          <li>
            <p>
              <strong>Персональні дані</strong> — це будь-яка інформація, що
              стосується ідентифікованої або такої, що може бути ідентифікована,
              особи.
            </p>
          </li>
          <li>
            <p>
              <strong>Сервіс</strong> означає Вебсайт.
            </p>
          </li>
          <li>
            <p>
              <strong>Постачальник послуг</strong> означає будь-яку фізичну або
              юридичну особу, яка обробляє дані від імені Компанії. Це може бути
              стороння компанія або особа, найнята Компанією для надання
              Сервісу, обслуговування Сервісу, надання послуг, пов’язаних із
              Сервісом, або допомоги Компанії в аналізі того, як
              використовується Сервіс.
            </p>
          </li>
          <li>
            <p>
              <strong>Дані про використання</strong> означають дані, що
              збираються автоматично, або генеруються при використанні Сервісу,
              або з інфраструктури Сервісу (наприклад, тривалість відвідування
              сторінки).
            </p>
          </li>
          <li>
            <p>
              <strong>Вебсайт</strong> означає FitMe, доступний за адресою:
              <a
                href="https://wixieee.github.io/FitMe/"
                rel="external nofollow noopener"
                target="_blank"
              >
                https://wixieee.github.io/FitMe/
              </a>
            </p>
          </li>
          <li>
            <p>
              <strong>Ви</strong> означає фізичну особу, яка отримує доступ до
              Сервісу або використовує його, або компанію чи іншу юридичну
              особу, від імені якої така фізична особа отримує доступ до Сервісу
              або використовує його, залежно від обставин.
            </p>
          </li>
        </ul>
        <h2>Збір і використання Ваших персональних даних</h2>
        <h3>Типи зібраних даних</h3> <h4>Персональні дані</h4>
        <p>
          Під час використання Нашого Сервісу Ми можемо просити Вас надати Нам
          певну особисту інформацію, яка може бути використана для зв’язку з
          Вами або для Вашої ідентифікації. Особиста інформація може включати,
          але не обмежується:
        </p>
        <ul>
          <li>
            <p>Адреса електронної пошти</p>
          </li>
          <li>
            <p>Ім’я та прізвище</p>
          </li>
          <li>
            <p>Дані про використання</p>
          </li>
        </ul>
        <h4>Дані про використання</h4>
        <p>
          Дані про використання збираються автоматично під час використання
          Сервісу.
        </p>
        <p>
          Дані про використання можуть включати таку інформацію, як IP-адреса
          Вашого пристрою, тип браузера, версія браузера, сторінки нашого
          Сервісу, які Ви відвідуєте, дата та час Вашого візиту, час, проведений
          на цих сторінках, унікальні ідентифікатори пристроїв та інші
          діагностичні дані.
        </p>
        <p>
          Коли Ви отримуєте доступ до Сервісу за допомогою мобільного пристрою
          або через нього, Ми можемо автоматично збирати певну інформацію,
          включаючи, але не обмежуючись, типом мобільного пристрою, який Ви
          використовуєте, унікальним ідентифікатором Вашого пристрою, IP-адресою
          Вашого мобільного пристрою, мобільною операційною системою, типом
          мобільного інтернет-браузера, який Ви використовуєте, унікальними
          ідентифікаторами пристроїв та іншими діагностичними даними.
        </p>
        <p>
          Ми також можемо збирати інформацію, яку Ваш браузер надсилає кожного
          разу, коли Ви відвідуєте наш Сервіс або коли Ви отримуєте доступ до
          Сервісу через мобільний пристрій.
        </p>
        <h4>Технології відстеження та файли cookie</h4>
        <p>
          Ми використовуємо файли cookie та подібні технології відстеження для
          моніторингу активності на нашому Сервісі та збереження певної
          інформації. Використовувані технології відстеження включають маячки,
          теги та скрипти для збору й відстеження інформації з метою покращення
          й аналізу нашого Сервісу. Серед технологій, які Ми використовуємо,
          можуть бути:
        </p>
        <ul>
          <li>
            <strong>Файли cookie або браузерні cookie.</strong> Cookie — це
            невеликий файл, що розміщується на Вашому пристрої. Ви можете
            налаштувати Ваш браузер на відмову від усіх cookie або на сповіщення
            про їх надсилання. Однак якщо Ви не приймаєте cookie, Ви можете не
            мати змоги користуватися деякими частинами нашого Сервісу. Якщо Ви
            не змінили налаштування браузера для відмови від cookie, наш Сервіс
            може їх використовувати.
          </li>
          <li>
            <strong>Веб-маячки.</strong> Деякі розділи нашого Сервісу та наші
            електронні листи можуть містити невеликі електронні файли, відомі як
            веб-маячки (також звані clear gifs, піксельні теги або однопіксельні
            gif), які дозволяють Компанії, наприклад, підраховувати кількість
            користувачів, які відвідали сторінки або відкрили електронний лист,
            а також для інших статистичних цілей (наприклад, визначення
            популярності розділу або перевірки цілісності системи та сервера).
          </li>
        </ul>
        <p>
          Cookie можуть бути <strong>постійними</strong> або
          <strong>сеансовими</strong>. Постійні cookie залишаються на Вашому
          комп’ютері або мобільному пристрої, коли Ви офлайн, тоді як сеансові
          cookie видаляються, як тільки Ви закриваєте браузер.
        </p>
        <p>
          Ми використовуємо як сеансові, так і постійні cookie для цілей,
          зазначених нижче:
        </p>
        <ul>
          <li>
            <p>
              <strong>Необхідні / Обов’язкові файли cookie</strong>
            </p>
            <p>Тип: Сеансові cookie</p> <p>Адмініструються: Нами</p>
            <p>
              Призначення: Ці cookie є необхідними для надання Вам послуг,
              доступних через Вебсайт, і для забезпечення можливості
              користуватися деякими його функціями. Вони допомагають
              автентифікувати користувачів і запобігати шахрайському
              використанню облікових записів. Без цих cookie надання запитуваних
              Вами послуг неможливе, і Ми використовуємо ці cookie виключно для
              надання таких послуг.
            </p>
          </li>
          <li>
            <p>
              <strong>
                Файли cookie щодо політики / сповіщення про використання cookie
              </strong>
            </p>
            <p>Тип: Постійні cookie</p> <p>Адмініструються: Нами</p>
            <p>
              Призначення: Ці cookie визначають, чи прийняв користувач
              використання cookie на Вебсайті.
            </p>
          </li>
          <li>
            <p>
              <strong>Функціональні файли cookie</strong>
            </p>
            <p>Тип: Постійні cookie</p> <p>Адмініструються: Нами</p>
            <p>
              Призначення: Ці cookie дозволяють нам запам’ятовувати вибір,
              зроблений Вами під час користування Вебсайтом, наприклад, Ваші
              облікові дані або мовні вподобання. Метою цих cookie є надання Вам
              більш персоналізованого досвіду та уникнення необхідності
              повторного введення інформації кожного разу при використанні
              Вебсайту.
            </p>
          </li>
        </ul>
        <p>
          Щоб дізнатися більше про файли cookie, які ми використовуємо, та про
          ваші варіанти вибору щодо файлів cookie, будь ласка, перегляньте нашу
          Політику щодо файлів cookie або розділ про файли cookie в нашій
          Політиці конфіденційності.
        </p>
        <h3>Використання Ваших Персональних Даних</h3>
        <p>Компанія може використовувати Персональні Дані для таких цілей:</p>
        <ul>
          <li>
            <p>
              <strong>Для надання та підтримки нашого Сервісу</strong>, включно
              з моніторингом використання нашого Сервісу.
            </p>
          </li>
          <li>
            <p>
              <strong>Для керування Вашим Обліковим записом:</strong> для
              керування Вашою реєстрацією як користувача Сервісу. Персональні
              Дані, які Ви надаєте, можуть надати Вам доступ до різних функцій
              Сервісу, доступних Вам як зареєстрованому користувачу.
            </p>
          </li>
          <li>
            <p>
              <strong>Для виконання контракту:</strong> виконання, дотримання та
              здійснення купівельного договору на товари чи послуги, які Ви
              придбали, або будь-якого іншого договору з нами через Сервіс.
            </p>
          </li>
          <li>
            <p>
              <strong>Для зв’язку з Вами:</strong> Для зв’язку з Вами через
              електронну пошту, телефонні дзвінки, SMS або інші форми
              електронного зв’язку, як-от push-сповіщення мобільного додатку
              щодо оновлень або інформаційних повідомлень, пов’язаних з
              функціональністю, продуктами чи послугами, включаючи оновлення
              безпеки.
            </p>
          </li>
          <li>
            <p>
              <strong>Щоб надавати Вам</strong> новини, спеціальні пропозиції та
              загальну інформацію про інші товари, послуги та події, подібні до
              тих, які Ви вже придбали або щодо яких зверталися, якщо Ви не
              відмовилися від отримання такої інформації.
            </p>
          </li>
          <li>
            <p>
              <strong>Для обробки Ваших запитів:</strong> Для обробки та
              управління Вашими запитами до Нас.
            </p>
          </li>
          <li>
            <p>
              <strong>Для передачі бізнесу:</strong> Ми можемо використовувати
              Вашу інформацію для оцінки або проведення злиття, продажу активів,
              реструктуризації або іншої передачі частини або всього нашого
              бізнесу.
            </p>
          </li>
          <li>
            <p>
              <strong>Для інших цілей:</strong> Ми можемо використовувати Вашу
              інформацію для аналітики, виявлення тенденцій, оцінки ефективності
              рекламних кампаній та вдосконалення нашого Сервісу, продуктів,
              послуг і Вашого досвіду.
            </p>
          </li>
        </ul>
        <p>
          Ми можемо ділитися Вашою персональною інформацією в таких випадках:
        </p>
        <ul>
          <li>
            <strong>З Постачальниками послуг:</strong> для аналізу використання
            Сервісу або для зв'язку з Вами.
          </li>
          <li>
            <strong>Під час передачі бізнесу:</strong> у зв’язку зі злиттям,
            продажем активів або придбанням бізнесу.
          </li>
          <li>
            <strong>З Афілійованими особами:</strong> якщо вони зобов’язуються
            дотримуватися цієї Політики конфіденційності.
          </li>
          <li>
            <strong>З Бізнес-партнерами:</strong> для пропозиції Вам певних
            продуктів або послуг.
          </li>
          <li>
            <strong>З іншими користувачами:</strong> коли Ви публічно надаєте
            інформацію або взаємодієте в публічних зонах Сервісу.
          </li>
          <li>
            <strong>З Вашої згоди:</strong> у будь-яких інших випадках за Вашою
            згодою.
          </li>
        </ul>
        <h3>Зберігання Ваших Персональних Даних</h3>
        <p>
          Компанія зберігатиме Ваші Персональні Дані лише протягом часу,
          необхідного для цілей, зазначених у цій Політиці конфіденційності.
          Також дані можуть зберігатися для виконання юридичних зобов’язань,
          вирішення спорів і забезпечення дотримання угод.
        </p>
        <h3>Передача Ваших Персональних Даних</h3>
        <p>
          Ваша інформація може зберігатися та оброблятися поза межами Вашої
          юрисдикції, де закони про захист даних можуть відрізнятися. Надсилаючи
          нам інформацію, Ви погоджуєтесь на таку передачу.
        </p>
        <h3>Видалення Ваших Персональних Даних</h3>
        <p>
          Ви маєте право видалити свої Персональні Дані або звернутися до нас із
          проханням зробити це. Ви можете змінити або видалити свої дані в
          налаштуваннях облікового запису або звернувшись до нас.
        </p>
        <h3>Розкриття Ваших Персональних Даних</h3>
        <h4>Бізнес-операції</h4>
        <p>
          У разі злиття або продажу Компанії Ваші дані можуть бути передані з
          відповідним попередженням.
        </p>
        <h4>Вимоги закону</h4>
        <p>
          Компанія може бути зобов’язана розкрити Ваші Персональні Дані згідно з
          вимогами закону або на запит органів влади.
        </p>
        <h4>Інші правові вимоги</h4>
        <p>
          Компанія може розкрити Ваші Персональні Дані, якщо це необхідно для:
        </p>
        <ul>
          <li>Виконання юридичного зобов’язання</li>
          <li>Захисту прав або власності Компанії</li>
          <li>Запобігання порушенням у зв’язку із Сервісом</li>
          <li>Захисту безпеки користувачів або суспільства</li>
          <li>Захисту від юридичної відповідальності</li>
        </ul>
        <h3>Безпека Ваших Персональних Даних</h3>
        <p>
          Ми прагнемо забезпечити безпеку Ваших даних, але жоден метод передачі
          чи зберігання в Інтернеті не є на 100% безпечним. Ми застосовуємо
          прийнятні комерційні засоби для їх захисту, однак не можемо
          гарантувати абсолютну безпеку.
        </p>
        <h2>Конфіденційність дітей</h2>
        <p>
          Наш Сервіс не призначений для осіб молодше 13 років. Ми не збираємо
          персональні дані дітей без згоди батьків. Якщо Ви дізналися, що Ваша
          дитина надала нам персональні дані, зв’яжіться з нами, і ми видалимо
          цю інформацію.
        </p>
        <h2>Посилання на інші вебсайти</h2>
        <p>
          Наш Сервіс може містити посилання на сторонні сайти. Ми не несемо
          відповідальності за політику конфіденційності таких сайтів і радимо
          ознайомлюватися з нею перед використанням.
        </p>
        <h2>Зміни до цієї Політики конфіденційності</h2>
        <p>
          Ми можемо періодично оновлювати Політику конфіденційності. Про зміни
          буде повідомлено на цій сторінці. Також Ви можете отримати сповіщення
          електронною поштою або через Сервіс.
        </p>
        <h2>Зв’язок з нами</h2>
        <p>
          Якщо у Вас є запитання щодо цієї Політики конфіденційності, Ви можете
          зв’язатися з нами за допомогою форми нижче.
        </p>
        <h1 id="terms-of-use">Умови використання FitMe</h1>
        <p>
          <strong>Останнє оновлення:</strong> [дата]
        </p>
        <p>Ласкаво просимо до FitMe!</p>
        <p>
          Ці Умови використання ("Умови") регулюють використання вами вебсайту
          та/або мобільного додатку FitMe ("Сервіс"), що надається [назва
          компанії або особи, яка управляє FitMe] ("Компанія", "ми", "нас",
          "наш").
        </p>
        <p>
          Будь ласка, уважно прочитайте ці Умови перед використанням Сервісу.
        </p>
        <h3>1. Прийняття умов</h3>
        <p>
          Отримуючи доступ або використовуючи Сервіс, ви погоджуєтесь
          дотримуватись цих Умов. Якщо ви не погоджуєтесь з будь-якою частиною
          Умов, ви не маєте права користуватись Сервісом.
        </p>
        <h3>2. Реєстрація облікового запису</h3>
        <p>
          Щоб скористатися певними функціями Сервісу, вам може знадобитись
          створити обліковий запис. Ви погоджуєтесь надавати достовірну, повну
          та актуальну інформацію при реєстрації.
        </p>
        <p>
          Ви несете відповідальність за збереження конфіденційності вашого
          пароля та облікового запису, а також за всі дії, що відбуваються під
          вашим обліковим записом.
        </p>
        <h3>3. Використання Сервісу</h3>
        <p>
          Ви погоджуєтесь використовувати Сервіс лише для законних цілей і
          відповідно до чинного законодавства. Забороняється:
        </p>
        <ul>
          <li>
            Використання Сервісу у будь-який незаконний чи шахрайський спосіб;
          </li>
          <li>
            Розповсюдження шкідливого програмного забезпечення або вірусів;
          </li>
          <li>Використання контенту Сервісу без дозволу;</li>
          <li>Порушення прав інших користувачів або третіх осіб.</li>
        </ul>
        <h3>4. Інтелектуальна власність</h3>
        <p>
          Весь контент Сервісу, включаючи, але не обмежуючись текстами,
          зображеннями, логотипами, ілюстраціями, програмним кодом — є власністю
          FitMe або наших ліцензіарів та захищений законами про авторські права
          та інші права інтелектуальної власності.
        </p>
        <h3>5. Підписки та платежі (якщо застосовно)</h3>
        <p>
          Деякі функції Сервісу можуть надаватись за підпискою або платно. Ви
          погоджуєтесь на оплату всіх відповідних зборів згідно з обраним вами
          планом. Підписка може автоматично поновлюватися, якщо ви не скасуєте
          її згідно інструкцій на сайті або в додатку.
        </p>
        <h3>6. Припинення доступу</h3>
        <p>
          Ми залишаємо за собою право припинити або призупинити ваш доступ до
          Сервісу негайно, без попередження, у разі порушення цих Умов або
          чинного законодавства.
        </p>
        <h3>7. Обмеження відповідальності</h3>
        <p>
          Сервіс надається "як є" та "як доступно". Ми не гарантуємо
          безперебійну роботу, відсутність помилок або повну безпеку Сервісу. У
          межах, дозволених законодавством, ми не несемо відповідальності за
          будь-які збитки, прямо чи опосередковано пов’язані з використанням
          Сервісу.
        </p>
        <h3>8. Посилання на сторонні ресурси</h3>
        <p>
          Сервіс може містити посилання на сторонні вебсайти або сервіси. Ми не
          контролюємо та не несемо відповідальності за вміст, політику
          конфіденційності або практики таких сторонніх ресурсів.
        </p>
        <h3>9. Зміни до Умов</h3>
        <p>
          Ми можемо періодично оновлювати ці Умови. Якщо зміни є суттєвими, ми
          повідомимо вас через Сервіс або електронну пошту. Продовжуючи
          користуватись Сервісом після набуття чинності змін, ви погоджуєтесь з
          оновленими Умовами.
        </p>
        <h3>10. Контактна інформація</h3>
        <p>
          Якщо у вас є запитання щодо цих Умов, будь ласка, зв’яжіться з нами
          через форму зворотного зв’язку в Сервісі або електронну пошту:{" "}
          <strong>[вказати email або форму]</strong>.
        </p>
      </div>
    </>
  );
};

export default Policy;
